retoure-dhl-client/DHL/XMLRequestOR3Amsel.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:var="https://amsel.dpwn.net/abholportal/gw/lp/schema/1.0/var3bl">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       soapenv:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>ws_online_retoure</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                    Anfang1!
                </wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <var:BookLabelRequest portalId="OnlineRetoure" deliveryName="Deutschland_Var3"
                              shipmentReference="Shipment Reference" customerReference="Customer Reference"
                              labelFormat="PDF" senderName1="Vorname - Firstname" senderName2="Nachname - Name"
                              senderCareOfName="CareofName" senderContactPhone="" senderStreet="Strasse - Street"
                              senderStreetNumber="Nr" senderBoxNumber="" senderPostalCode="12345"
                              senderCity="Ort - City"/>
    </soapenv:Body>
</soapenv:Envelope>
